index.html

<div id="outline-container-orgc1e8b01" class="outline-3">
<h3 id="orgc1e8b01"><span class="section-number-3">1.4.</span> lshw</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-shell">lshw -json
</pre>
</div>

<div class="org-src-container">
<pre class="src src-json">[
{
  <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"vermin-x510ua"</span>,
  <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"system"</span>,
  <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
  <span style="color: #005077; font-weight: bold;">"description"</span> : <span style="color: #30440f;">"Computer"</span>,
  <span style="color: #005077; font-weight: bold;">"width"</span> : <span style="color: #0000c0;">64</span>,
  <span style="color: #005077; font-weight: bold;">"capabilities"</span> : {
    <span style="color: #005077; font-weight: bold;">"smp"</span> : <span style="color: #30440f;">"Symmetric Multi-Processing"</span>,
    <span style="color: #005077; font-weight: bold;">"vsyscall32"</span> : <span style="color: #30440f;">"32-bit processes"</span>
  },
  <span style="color: #005077; font-weight: bold;">"children"</span> : [
    {
      <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"core"</span>,
      <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"bus"</span>,
      <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
      <span style="color: #005077; font-weight: bold;">"description"</span> : <span style="color: #30440f;">"Motherboard"</span>,
      <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"0"</span>,
      <span style="color: #005077; font-weight: bold;">"children"</span> : [
        {
          <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"memory"</span>,
          <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"memory"</span>,
          <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
          <span style="color: #005077; font-weight: bold;">"description"</span> : <span style="color: #30440f;">"System memory"</span>,
          <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"0"</span>,
          <span style="color: #005077; font-weight: bold;">"units"</span> : <span style="color: #30440f;">"bytes"</span>,
          <span style="color: #005077; font-weight: bold;">"size"</span> : <span style="color: #0000c0;">12884901888</span>
        },
        {
          <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"cpu"</span>,
          <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"processor"</span>,
          <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
          <span style="color: #005077; font-weight: bold;">"product"</span> : <span style="color: #30440f;">"Intel(R) Core(TM) i3-7100U CPU @ 2.40GHz"</span>,
          <span style="color: #005077; font-weight: bold;">"vendor"</span> : <span style="color: #30440f;">"Intel Corp."</span>,
          <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"1"</span>,
          <span style="color: #005077; font-weight: bold;">"businfo"</span> : <span style="color: #30440f;">"cpu@0"</span>,
          <span style="color: #005077; font-weight: bold;">"units"</span> : <span style="color: #30440f;">"Hz"</span>,
          <span style="color: #005077; font-weight: bold;">"size"</span> : <span style="color: #0000c0;">2400000000</span>,
          <span style="color: #005077; font-weight: bold;">"capacity"</span> : <span style="color: #0000c0;">2400000000</span>,
          <span style="color: #005077; font-weight: bold;">"width"</span> : <span style="color: #0000c0;">64</span>,
          <span style="color: #005077; font-weight: bold;">"capabilities"</span> : {
            <span style="color: #005077; font-weight: bold;">"fpu"</span> : <span style="color: #30440f;">"mathematical co-processor"</span>,
            <span style="color: #005077; font-weight: bold;">"fpu_exception"</span> : <span style="color: #30440f;">"FPU exceptions reporting"</span>,
            <span style="color: #005077; font-weight: bold;">"wp"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"vme"</span> : <span style="color: #30440f;">"virtual mode extensions"</span>,
            <span style="color: #005077; font-weight: bold;">"de"</span> : <span style="color: #30440f;">"debugging extensions"</span>,
            <span style="color: #005077; font-weight: bold;">"pse"</span> : <span style="color: #30440f;">"page size extensions"</span>,
            <span style="color: #005077; font-weight: bold;">"tsc"</span> : <span style="color: #30440f;">"time stamp counter"</span>,
            <span style="color: #005077; font-weight: bold;">"msr"</span> : <span style="color: #30440f;">"model-specific registers"</span>,
            <span style="color: #005077; font-weight: bold;">"pae"</span> : <span style="color: #30440f;">"4GB+ memory addressing (Physical Address Extension)"</span>,
            <span style="color: #005077; font-weight: bold;">"mce"</span> : <span style="color: #30440f;">"machine check exceptions"</span>,
            <span style="color: #005077; font-weight: bold;">"cx8"</span> : <span style="color: #30440f;">"compare and exchange 8-byte"</span>,
            <span style="color: #005077; font-weight: bold;">"apic"</span> : <span style="color: #30440f;">"on-chip advanced programmable interrupt controller (APIC)"</span>,
            <span style="color: #005077; font-weight: bold;">"sep"</span> : <span style="color: #30440f;">"fast system calls"</span>,
            <span style="color: #005077; font-weight: bold;">"mtrr"</span> : <span style="color: #30440f;">"memory type range registers"</span>,
            <span style="color: #005077; font-weight: bold;">"pge"</span> : <span style="color: #30440f;">"page global enable"</span>,
            <span style="color: #005077; font-weight: bold;">"mca"</span> : <span style="color: #30440f;">"machine check architecture"</span>,
            <span style="color: #005077; font-weight: bold;">"cmov"</span> : <span style="color: #30440f;">"conditional move instruction"</span>,
            <span style="color: #005077; font-weight: bold;">"pat"</span> : <span style="color: #30440f;">"page attribute table"</span>,
            <span style="color: #005077; font-weight: bold;">"pse36"</span> : <span style="color: #30440f;">"36-bit page size extensions"</span>,
            <span style="color: #005077; font-weight: bold;">"clflush"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"dts"</span> : <span style="color: #30440f;">"debug trace and EMON store MSRs"</span>,
            <span style="color: #005077; font-weight: bold;">"acpi"</span> : <span style="color: #30440f;">"thermal control (ACPI)"</span>,
            <span style="color: #005077; font-weight: bold;">"mmx"</span> : <span style="color: #30440f;">"multimedia extensions (MMX)"</span>,
            <span style="color: #005077; font-weight: bold;">"fxsr"</span> : <span style="color: #30440f;">"fast floating point save/restore"</span>,
            <span style="color: #005077; font-weight: bold;">"sse"</span> : <span style="color: #30440f;">"streaming SIMD extensions (SSE)"</span>,
            <span style="color: #005077; font-weight: bold;">"sse2"</span> : <span style="color: #30440f;">"streaming SIMD extensions (SSE2)"</span>,
            <span style="color: #005077; font-weight: bold;">"ss"</span> : <span style="color: #30440f;">"self-snoop"</span>,
            <span style="color: #005077; font-weight: bold;">"ht"</span> : <span style="color: #30440f;">"HyperThreading"</span>,
            <span style="color: #005077; font-weight: bold;">"tm"</span> : <span style="color: #30440f;">"thermal interrupt and status"</span>,
            <span style="color: #005077; font-weight: bold;">"pbe"</span> : <span style="color: #30440f;">"pending break event"</span>,
            <span style="color: #005077; font-weight: bold;">"syscall"</span> : <span style="color: #30440f;">"fast system calls"</span>,
            <span style="color: #005077; font-weight: bold;">"nx"</span> : <span style="color: #30440f;">"no-execute bit (NX)"</span>,
            <span style="color: #005077; font-weight: bold;">"pdpe1gb"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"rdtscp"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"x86-64"</span> : <span style="color: #30440f;">"64bits extensions (x86-64)"</span>,
            <span style="color: #005077; font-weight: bold;">"constant_tsc"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"art"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"arch_perfmon"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"pebs"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"bts"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"rep_good"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"nopl"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"xtopology"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"nonstop_tsc"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"cpuid"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"aperfmperf"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"pni"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"pclmulqdq"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"dtes64"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"monitor"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"ds_cpl"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"vmx"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"est"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"tm2"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"ssse3"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"sdbg"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"fma"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"cx16"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"xtpr"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"pdcm"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"pcid"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"sse4_1"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"sse4_2"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"x2apic"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"movbe"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"popcnt"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"tsc_deadline_timer"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"aes"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"xsave"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"avx"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"f16c"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"rdrand"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"lahf_lm"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"abm"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"3dnowprefetch"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"cpuid_fault"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"epb"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"invpcid_single"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"pti"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"ssbd"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"ibrs"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"ibpb"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"stibp"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"tpr_shadow"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"vnmi"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"flexpriority"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"ept"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"vpid"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"ept_ad"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"fsgsbase"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"tsc_adjust"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"bmi1"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"avx2"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"smep"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"bmi2"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"erms"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"invpcid"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"mpx"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"rdseed"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"adx"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"smap"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"clflushopt"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"intel_pt"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"xsaveopt"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"xsavec"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"xgetbv1"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"xsaves"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"dtherm"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"arat"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"pln"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"pts"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"hwp"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"hwp_notify"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"hwp_act_window"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"hwp_epp"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"md_clear"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"flush_l1d"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"arch_capabilities"</span> : <span style="color: #55348e;">true</span>,
            <span style="color: #005077; font-weight: bold;">"cpufreq"</span> : <span style="color: #30440f;">"CPU Frequency scaling"</span>
          }
        },
        {
          <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"pci"</span>,
          <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"bridge"</span>,
          <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
          <span style="color: #005077; font-weight: bold;">"handle"</span> : <span style="color: #30440f;">"PCIBUS:0000:00"</span>,
          <span style="color: #005077; font-weight: bold;">"description"</span> : <span style="color: #30440f;">"Host bridge"</span>,
          <span style="color: #005077; font-weight: bold;">"product"</span> : <span style="color: #30440f;">"Xeon E3-1200 v6/7th Gen Core Processor Host Bridge/DRAM Registers"</span>,
          <span style="color: #005077; font-weight: bold;">"vendor"</span> : <span style="color: #30440f;">"Intel Corporation"</span>,
          <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"100"</span>,
          <span style="color: #005077; font-weight: bold;">"businfo"</span> : <span style="color: #30440f;">"pci@0000:00:00.0"</span>,
          <span style="color: #005077; font-weight: bold;">"version"</span> : <span style="color: #30440f;">"02"</span>,
          <span style="color: #005077; font-weight: bold;">"width"</span> : <span style="color: #0000c0;">32</span>,
          <span style="color: #005077; font-weight: bold;">"clock"</span> : <span style="color: #0000c0;">33000000</span>,
          <span style="color: #005077; font-weight: bold;">"configuration"</span> : {
            <span style="color: #005077; font-weight: bold;">"driver"</span> : <span style="color: #30440f;">"skl_uncore"</span>
          },
          <span style="color: #005077; font-weight: bold;">"children"</span> : [
            {
              <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"display"</span>,
              <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"display"</span>,
              <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
              <span style="color: #005077; font-weight: bold;">"handle"</span> : <span style="color: #30440f;">"PCI:0000:00:02.0"</span>,
              <span style="color: #005077; font-weight: bold;">"description"</span> : <span style="color: #30440f;">"VGA compatible controller"</span>,
              <span style="color: #005077; font-weight: bold;">"product"</span> : <span style="color: #30440f;">"HD Graphics 620"</span>,
              <span style="color: #005077; font-weight: bold;">"vendor"</span> : <span style="color: #30440f;">"Intel Corporation"</span>,
              <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"2"</span>,
              <span style="color: #005077; font-weight: bold;">"businfo"</span> : <span style="color: #30440f;">"pci@0000:00:02.0"</span>,
              <span style="color: #005077; font-weight: bold;">"version"</span> : <span style="color: #30440f;">"02"</span>,
              <span style="color: #005077; font-weight: bold;">"width"</span> : <span style="color: #0000c0;">64</span>,
              <span style="color: #005077; font-weight: bold;">"clock"</span> : <span style="color: #0000c0;">33000000</span>,
              <span style="color: #005077; font-weight: bold;">"configuration"</span> : {
                <span style="color: #005077; font-weight: bold;">"driver"</span> : <span style="color: #30440f;">"i915"</span>,
                <span style="color: #005077; font-weight: bold;">"latency"</span> : <span style="color: #30440f;">"0"</span>
              },
              <span style="color: #005077; font-weight: bold;">"capabilities"</span> : {
                <span style="color: #005077; font-weight: bold;">"vga_controller"</span> : <span style="color: #55348e;">true</span>,
                <span style="color: #005077; font-weight: bold;">"bus_master"</span> : <span style="color: #30440f;">"bus mastering"</span>,
                <span style="color: #005077; font-weight: bold;">"cap_list"</span> : <span style="color: #30440f;">"PCI capabilities listing"</span>,
                <span style="color: #005077; font-weight: bold;">"rom"</span> : <span style="color: #30440f;">"extension ROM"</span>
              }
            },
            {
              <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"generic:0"</span>,
              <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"generic"</span>,
              <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
              <span style="color: #005077; font-weight: bold;">"handle"</span> : <span style="color: #30440f;">"PCI:0000:00:04.0"</span>,
              <span style="color: #005077; font-weight: bold;">"description"</span> : <span style="color: #30440f;">"Signal processing controller"</span>,
              <span style="color: #005077; font-weight: bold;">"product"</span> : <span style="color: #30440f;">"Xeon E3-1200 v5/E3-1500 v5/6th Gen Core Processor Thermal Subsystem"</span>,
              <span style="color: #005077; font-weight: bold;">"vendor"</span> : <span style="color: #30440f;">"Intel Corporation"</span>,
              <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"4"</span>,
              <span style="color: #005077; font-weight: bold;">"businfo"</span> : <span style="color: #30440f;">"pci@0000:00:04.0"</span>,
              <span style="color: #005077; font-weight: bold;">"version"</span> : <span style="color: #30440f;">"02"</span>,
              <span style="color: #005077; font-weight: bold;">"width"</span> : <span style="color: #0000c0;">64</span>,
              <span style="color: #005077; font-weight: bold;">"clock"</span> : <span style="color: #0000c0;">33000000</span>,
              <span style="color: #005077; font-weight: bold;">"configuration"</span> : {
                <span style="color: #005077; font-weight: bold;">"driver"</span> : <span style="color: #30440f;">"proc_thermal"</span>,
                <span style="color: #005077; font-weight: bold;">"latency"</span> : <span style="color: #30440f;">"0"</span>
              },
              <span style="color: #005077; font-weight: bold;">"capabilities"</span> : {
                <span style="color: #005077; font-weight: bold;">"cap_list"</span> : <span style="color: #30440f;">"PCI capabilities listing"</span>
              }
            },
            {
              <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"usb"</span>,
              <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"bus"</span>,
              <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
              <span style="color: #005077; font-weight: bold;">"handle"</span> : <span style="color: #30440f;">"PCI:0000:00:14.0"</span>,
              <span style="color: #005077; font-weight: bold;">"description"</span> : <span style="color: #30440f;">"USB controller"</span>,
              <span style="color: #005077; font-weight: bold;">"product"</span> : <span style="color: #30440f;">"Sunrise Point-LP USB 3.0 xHCI Controller"</span>,
              <span style="color: #005077; font-weight: bold;">"vendor"</span> : <span style="color: #30440f;">"Intel Corporation"</span>,
              <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"14"</span>,
              <span style="color: #005077; font-weight: bold;">"businfo"</span> : <span style="color: #30440f;">"pci@0000:00:14.0"</span>,
              <span style="color: #005077; font-weight: bold;">"version"</span> : <span style="color: #30440f;">"21"</span>,
              <span style="color: #005077; font-weight: bold;">"width"</span> : <span style="color: #0000c0;">64</span>,
              <span style="color: #005077; font-weight: bold;">"clock"</span> : <span style="color: #0000c0;">33000000</span>,
              <span style="color: #005077; font-weight: bold;">"configuration"</span> : {
                <span style="color: #005077; font-weight: bold;">"driver"</span> : <span style="color: #30440f;">"xhci_hcd"</span>,
                <span style="color: #005077; font-weight: bold;">"latency"</span> : <span style="color: #30440f;">"0"</span>
              },
              <span style="color: #005077; font-weight: bold;">"capabilities"</span> : {
                <span style="color: #005077; font-weight: bold;">"xhci"</span> : <span style="color: #55348e;">true</span>,
                <span style="color: #005077; font-weight: bold;">"bus_master"</span> : <span style="color: #30440f;">"bus mastering"</span>,
                <span style="color: #005077; font-weight: bold;">"cap_list"</span> : <span style="color: #30440f;">"PCI capabilities listing"</span>
              }
            },
            {
              <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"generic:1"</span>,
              <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"generic"</span>,
              <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
              <span style="color: #005077; font-weight: bold;">"handle"</span> : <span style="color: #30440f;">"PCI:0000:00:14.2"</span>,
              <span style="color: #005077; font-weight: bold;">"description"</span> : <span style="color: #30440f;">"Signal processing controller"</span>,
              <span style="color: #005077; font-weight: bold;">"product"</span> : <span style="color: #30440f;">"Sunrise Point-LP Thermal subsystem"</span>,
              <span style="color: #005077; font-weight: bold;">"vendor"</span> : <span style="color: #30440f;">"Intel Corporation"</span>,
              <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"14.2"</span>,
              <span style="color: #005077; font-weight: bold;">"businfo"</span> : <span style="color: #30440f;">"pci@0000:00:14.2"</span>,
              <span style="color: #005077; font-weight: bold;">"version"</span> : <span style="color: #30440f;">"21"</span>,
              <span style="color: #005077; font-weight: bold;">"width"</span> : <span style="color: #0000c0;">64</span>,
              <span style="color: #005077; font-weight: bold;">"clock"</span> : <span style="color: #0000c0;">33000000</span>,
              <span style="color: #005077; font-weight: bold;">"configuration"</span> : {
                <span style="color: #005077; font-weight: bold;">"driver"</span> : <span style="color: #30440f;">"intel_pch_thermal"</span>,
                <span style="color: #005077; font-weight: bold;">"latency"</span> : <span style="color: #30440f;">"0"</span>
              },
              <span style="color: #005077; font-weight: bold;">"capabilities"</span> : {
                <span style="color: #005077; font-weight: bold;">"cap_list"</span> : <span style="color: #30440f;">"PCI capabilities listing"</span>
              }
            },
            {
              <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"generic:2"</span>,
              <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"generic"</span>,
              <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
              <span style="color: #005077; font-weight: bold;">"handle"</span> : <span style="color: #30440f;">"PCI:0000:00:15.0"</span>,
              <span style="color: #005077; font-weight: bold;">"description"</span> : <span style="color: #30440f;">"Signal processing controller"</span>,
              <span style="color: #005077; font-weight: bold;">"product"</span> : <span style="color: #30440f;">"Sunrise Point-LP Serial IO I2C Controller #0"</span>,
              <span style="color: #005077; font-weight: bold;">"vendor"</span> : <span style="color: #30440f;">"Intel Corporation"</span>,
              <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"15"</span>,
              <span style="color: #005077; font-weight: bold;">"businfo"</span> : <span style="color: #30440f;">"pci@0000:00:15.0"</span>,
              <span style="color: #005077; font-weight: bold;">"version"</span> : <span style="color: #30440f;">"21"</span>,
              <span style="color: #005077; font-weight: bold;">"width"</span> : <span style="color: #0000c0;">64</span>,
              <span style="color: #005077; font-weight: bold;">"clock"</span> : <span style="color: #0000c0;">33000000</span>,
              <span style="color: #005077; font-weight: bold;">"configuration"</span> : {
                <span style="color: #005077; font-weight: bold;">"driver"</span> : <span style="color: #30440f;">"intel-lpss"</span>,
                <span style="color: #005077; font-weight: bold;">"latency"</span> : <span style="color: #30440f;">"0"</span>
              },
              <span style="color: #005077; font-weight: bold;">"capabilities"</span> : {
                <span style="color: #005077; font-weight: bold;">"bus_master"</span> : <span style="color: #30440f;">"bus mastering"</span>,
                <span style="color: #005077; font-weight: bold;">"cap_list"</span> : <span style="color: #30440f;">"PCI capabilities listing"</span>
              }
            },
            {
              <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"generic:3"</span>,
              <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"generic"</span>,
              <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
              <span style="color: #005077; font-weight: bold;">"handle"</span> : <span style="color: #30440f;">"PCI:0000:00:15.1"</span>,
              <span style="color: #005077; font-weight: bold;">"description"</span> : <span style="color: #30440f;">"Signal processing controller"</span>,
              <span style="color: #005077; font-weight: bold;">"product"</span> : <span style="color: #30440f;">"Sunrise Point-LP Serial IO I2C Controller #1"</span>,
              <span style="color: #005077; font-weight: bold;">"vendor"</span> : <span style="color: #30440f;">"Intel Corporation"</span>,
              <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"15.1"</span>,
              <span style="color: #005077; font-weight: bold;">"businfo"</span> : <span style="color: #30440f;">"pci@0000:00:15.1"</span>,
              <span style="color: #005077; font-weight: bold;">"version"</span> : <span style="color: #30440f;">"21"</span>,
              <span style="color: #005077; font-weight: bold;">"width"</span> : <span style="color: #0000c0;">64</span>,
              <span style="color: #005077; font-weight: bold;">"clock"</span> : <span style="color: #0000c0;">33000000</span>,
              <span style="color: #005077; font-weight: bold;">"configuration"</span> : {
                <span style="color: #005077; font-weight: bold;">"driver"</span> : <span style="color: #30440f;">"intel-lpss"</span>,
                <span style="color: #005077; font-weight: bold;">"latency"</span> : <span style="color: #30440f;">"0"</span>
              },
              <span style="color: #005077; font-weight: bold;">"capabilities"</span> : {
                <span style="color: #005077; font-weight: bold;">"bus_master"</span> : <span style="color: #30440f;">"bus mastering"</span>,
                <span style="color: #005077; font-weight: bold;">"cap_list"</span> : <span style="color: #30440f;">"PCI capabilities listing"</span>
              }
            },
            {
              <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"communication"</span>,
              <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"communication"</span>,
              <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
              <span style="color: #005077; font-weight: bold;">"handle"</span> : <span style="color: #30440f;">"PCI:0000:00:16.0"</span>,
              <span style="color: #005077; font-weight: bold;">"description"</span> : <span style="color: #30440f;">"Communication controller"</span>,
              <span style="color: #005077; font-weight: bold;">"product"</span> : <span style="color: #30440f;">"Sunrise Point-LP CSME HECI #1"</span>,
              <span style="color: #005077; font-weight: bold;">"vendor"</span> : <span style="color: #30440f;">"Intel Corporation"</span>,
              <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"16"</span>,
              <span style="color: #005077; font-weight: bold;">"businfo"</span> : <span style="color: #30440f;">"pci@0000:00:16.0"</span>,
              <span style="color: #005077; font-weight: bold;">"version"</span> : <span style="color: #30440f;">"21"</span>,
              <span style="color: #005077; font-weight: bold;">"width"</span> : <span style="color: #0000c0;">64</span>,
              <span style="color: #005077; font-weight: bold;">"clock"</span> : <span style="color: #0000c0;">33000000</span>,
              <span style="color: #005077; font-weight: bold;">"configuration"</span> : {
                <span style="color: #005077; font-weight: bold;">"driver"</span> : <span style="color: #30440f;">"mei_me"</span>,
                <span style="color: #005077; font-weight: bold;">"latency"</span> : <span style="color: #30440f;">"0"</span>
              },
              <span style="color: #005077; font-weight: bold;">"capabilities"</span> : {
                <span style="color: #005077; font-weight: bold;">"bus_master"</span> : <span style="color: #30440f;">"bus mastering"</span>,
                <span style="color: #005077; font-weight: bold;">"cap_list"</span> : <span style="color: #30440f;">"PCI capabilities listing"</span>
              }
            },
            {
              <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"sata"</span>,
              <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"storage"</span>,
              <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
              <span style="color: #005077; font-weight: bold;">"handle"</span> : <span style="color: #30440f;">"PCI:0000:00:17.0"</span>,
              <span style="color: #005077; font-weight: bold;">"description"</span> : <span style="color: #30440f;">"SATA controller"</span>,
              <span style="color: #005077; font-weight: bold;">"product"</span> : <span style="color: #30440f;">"Sunrise Point-LP SATA Controller [AHCI mode]"</span>,
              <span style="color: #005077; font-weight: bold;">"vendor"</span> : <span style="color: #30440f;">"Intel Corporation"</span>,
              <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"17"</span>,
              <span style="color: #005077; font-weight: bold;">"businfo"</span> : <span style="color: #30440f;">"pci@0000:00:17.0"</span>,
              <span style="color: #005077; font-weight: bold;">"version"</span> : <span style="color: #30440f;">"21"</span>,
              <span style="color: #005077; font-weight: bold;">"width"</span> : <span style="color: #0000c0;">32</span>,
              <span style="color: #005077; font-weight: bold;">"clock"</span> : <span style="color: #0000c0;">66000000</span>,
              <span style="color: #005077; font-weight: bold;">"configuration"</span> : {
                <span style="color: #005077; font-weight: bold;">"driver"</span> : <span style="color: #30440f;">"ahci"</span>,
                <span style="color: #005077; font-weight: bold;">"latency"</span> : <span style="color: #30440f;">"0"</span>
              },
              <span style="color: #005077; font-weight: bold;">"capabilities"</span> : {
                <span style="color: #005077; font-weight: bold;">"sata"</span> : <span style="color: #55348e;">true</span>,
                <span style="color: #005077; font-weight: bold;">"ahci_1.0"</span> : <span style="color: #55348e;">true</span>,
                <span style="color: #005077; font-weight: bold;">"bus_master"</span> : <span style="color: #30440f;">"bus mastering"</span>,
                <span style="color: #005077; font-weight: bold;">"cap_list"</span> : <span style="color: #30440f;">"PCI capabilities listing"</span>
              }
            },
            {
              <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"pci:0"</span>,
              <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"bridge"</span>,
              <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
              <span style="color: #005077; font-weight: bold;">"handle"</span> : <span style="color: #30440f;">"PCIBUS:0000:01"</span>,
              <span style="color: #005077; font-weight: bold;">"description"</span> : <span style="color: #30440f;">"PCI bridge"</span>,
              <span style="color: #005077; font-weight: bold;">"product"</span> : <span style="color: #30440f;">"Sunrise Point-LP PCI Express Root Port #1"</span>,
              <span style="color: #005077; font-weight: bold;">"vendor"</span> : <span style="color: #30440f;">"Intel Corporation"</span>,
              <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"1c"</span>,
              <span style="color: #005077; font-weight: bold;">"businfo"</span> : <span style="color: #30440f;">"pci@0000:00:1c.0"</span>,
              <span style="color: #005077; font-weight: bold;">"version"</span> : <span style="color: #30440f;">"f1"</span>,
              <span style="color: #005077; font-weight: bold;">"width"</span> : <span style="color: #0000c0;">32</span>,
              <span style="color: #005077; font-weight: bold;">"clock"</span> : <span style="color: #0000c0;">33000000</span>,
              <span style="color: #005077; font-weight: bold;">"configuration"</span> : {
                <span style="color: #005077; font-weight: bold;">"driver"</span> : <span style="color: #30440f;">"pcieport"</span>
              },
              <span style="color: #005077; font-weight: bold;">"capabilities"</span> : {
                <span style="color: #005077; font-weight: bold;">"pci"</span> : <span style="color: #55348e;">true</span>,
                <span style="color: #005077; font-weight: bold;">"normal_decode"</span> : <span style="color: #55348e;">true</span>,
                <span style="color: #005077; font-weight: bold;">"bus_master"</span> : <span style="color: #30440f;">"bus mastering"</span>,
                <span style="color: #005077; font-weight: bold;">"cap_list"</span> : <span style="color: #30440f;">"PCI capabilities listing"</span>
              }
            },
            {
              <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"pci:1"</span>,
              <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"bridge"</span>,
              <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
              <span style="color: #005077; font-weight: bold;">"handle"</span> : <span style="color: #30440f;">"PCIBUS:0000:02"</span>,
              <span style="color: #005077; font-weight: bold;">"description"</span> : <span style="color: #30440f;">"PCI bridge"</span>,
              <span style="color: #005077; font-weight: bold;">"product"</span> : <span style="color: #30440f;">"Sunrise Point-LP PCI Express Root Port #6"</span>,
              <span style="color: #005077; font-weight: bold;">"vendor"</span> : <span style="color: #30440f;">"Intel Corporation"</span>,
              <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"1c.5"</span>,
              <span style="color: #005077; font-weight: bold;">"businfo"</span> : <span style="color: #30440f;">"pci@0000:00:1c.5"</span>,
              <span style="color: #005077; font-weight: bold;">"version"</span> : <span style="color: #30440f;">"f1"</span>,
              <span style="color: #005077; font-weight: bold;">"width"</span> : <span style="color: #0000c0;">32</span>,
              <span style="color: #005077; font-weight: bold;">"clock"</span> : <span style="color: #0000c0;">33000000</span>,
              <span style="color: #005077; font-weight: bold;">"configuration"</span> : {
                <span style="color: #005077; font-weight: bold;">"driver"</span> : <span style="color: #30440f;">"pcieport"</span>
              },
              <span style="color: #005077; font-weight: bold;">"capabilities"</span> : {
                <span style="color: #005077; font-weight: bold;">"pci"</span> : <span style="color: #55348e;">true</span>,
                <span style="color: #005077; font-weight: bold;">"normal_decode"</span> : <span style="color: #55348e;">true</span>,
                <span style="color: #005077; font-weight: bold;">"bus_master"</span> : <span style="color: #30440f;">"bus mastering"</span>,
                <span style="color: #005077; font-weight: bold;">"cap_list"</span> : <span style="color: #30440f;">"PCI capabilities listing"</span>
              },
              <span style="color: #005077; font-weight: bold;">"children"</span> : [
                {
                  <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"network"</span>,
                  <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"network"</span>,
                  <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
                  <span style="color: #005077; font-weight: bold;">"handle"</span> : <span style="color: #30440f;">"PCI:0000:02:00.0"</span>,
                  <span style="color: #005077; font-weight: bold;">"description"</span> : <span style="color: #30440f;">"Wireless interface"</span>,
                  <span style="color: #005077; font-weight: bold;">"product"</span> : <span style="color: #30440f;">"Wireless 8265 / 8275"</span>,
                  <span style="color: #005077; font-weight: bold;">"vendor"</span> : <span style="color: #30440f;">"Intel Corporation"</span>,
                  <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"0"</span>,
                  <span style="color: #005077; font-weight: bold;">"businfo"</span> : <span style="color: #30440f;">"pci@0000:02:00.0"</span>,
                  <span style="color: #005077; font-weight: bold;">"logicalname"</span> : <span style="color: #30440f;">"wlan0"</span>,
                  <span style="color: #005077; font-weight: bold;">"version"</span> : <span style="color: #30440f;">"78"</span>,
                  <span style="color: #005077; font-weight: bold;">"serial"</span> : <span style="color: #30440f;">"60:f6:77:ef:81:34"</span>,
                  <span style="color: #005077; font-weight: bold;">"width"</span> : <span style="color: #0000c0;">64</span>,
                  <span style="color: #005077; font-weight: bold;">"clock"</span> : <span style="color: #0000c0;">33000000</span>,
                  <span style="color: #005077; font-weight: bold;">"configuration"</span> : {
                    <span style="color: #005077; font-weight: bold;">"broadcast"</span> : <span style="color: #30440f;">"yes"</span>,
                    <span style="color: #005077; font-weight: bold;">"driver"</span> : <span style="color: #30440f;">"iwlwifi"</span>,
                    <span style="color: #005077; font-weight: bold;">"driverversion"</span> : <span style="color: #30440f;">"5.15.86-1-lts"</span>,
                    <span style="color: #005077; font-weight: bold;">"firmware"</span> : <span style="color: #30440f;">"36.ca7b901d.0 8265-36.ucode"</span>,
                    <span style="color: #005077; font-weight: bold;">"ip"</span> : <span style="color: #30440f;">"192.168.1.37"</span>,
                    <span style="color: #005077; font-weight: bold;">"latency"</span> : <span style="color: #30440f;">"0"</span>,
                    <span style="color: #005077; font-weight: bold;">"link"</span> : <span style="color: #30440f;">"yes"</span>,
                    <span style="color: #005077; font-weight: bold;">"multicast"</span> : <span style="color: #30440f;">"yes"</span>,
                    <span style="color: #005077; font-weight: bold;">"wireless"</span> : <span style="color: #30440f;">"IEEE 802.11"</span>
                  },
                  <span style="color: #005077; font-weight: bold;">"capabilities"</span> : {
                    <span style="color: #005077; font-weight: bold;">"bus_master"</span> : <span style="color: #30440f;">"bus mastering"</span>,
                    <span style="color: #005077; font-weight: bold;">"cap_list"</span> : <span style="color: #30440f;">"PCI capabilities listing"</span>,
                    <span style="color: #005077; font-weight: bold;">"ethernet"</span> : <span style="color: #55348e;">true</span>,
                    <span style="color: #005077; font-weight: bold;">"physical"</span> : <span style="color: #30440f;">"Physical interface"</span>,
                    <span style="color: #005077; font-weight: bold;">"wireless"</span> : <span style="color: #30440f;">"Wireless-LAN"</span>
                  }
                }
              ]
            },
            {
              <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"generic:4"</span>,
              <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"generic"</span>,
              <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
              <span style="color: #005077; font-weight: bold;">"handle"</span> : <span style="color: #30440f;">"PCI:0000:00:1e.0"</span>,
              <span style="color: #005077; font-weight: bold;">"description"</span> : <span style="color: #30440f;">"Signal processing controller"</span>,
              <span style="color: #005077; font-weight: bold;">"product"</span> : <span style="color: #30440f;">"Sunrise Point-LP Serial IO UART Controller #0"</span>,
              <span style="color: #005077; font-weight: bold;">"vendor"</span> : <span style="color: #30440f;">"Intel Corporation"</span>,
              <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"1e"</span>,
              <span style="color: #005077; font-weight: bold;">"businfo"</span> : <span style="color: #30440f;">"pci@0000:00:1e.0"</span>,
              <span style="color: #005077; font-weight: bold;">"version"</span> : <span style="color: #30440f;">"21"</span>,
              <span style="color: #005077; font-weight: bold;">"width"</span> : <span style="color: #0000c0;">64</span>,
              <span style="color: #005077; font-weight: bold;">"clock"</span> : <span style="color: #0000c0;">33000000</span>,
              <span style="color: #005077; font-weight: bold;">"configuration"</span> : {
                <span style="color: #005077; font-weight: bold;">"driver"</span> : <span style="color: #30440f;">"intel-lpss"</span>,
                <span style="color: #005077; font-weight: bold;">"latency"</span> : <span style="color: #30440f;">"0"</span>
              },
              <span style="color: #005077; font-weight: bold;">"capabilities"</span> : {
                <span style="color: #005077; font-weight: bold;">"bus_master"</span> : <span style="color: #30440f;">"bus mastering"</span>,
                <span style="color: #005077; font-weight: bold;">"cap_list"</span> : <span style="color: #30440f;">"PCI capabilities listing"</span>
              }
            },
            {
              <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"generic:5"</span>,
              <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"generic"</span>,
              <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
              <span style="color: #005077; font-weight: bold;">"handle"</span> : <span style="color: #30440f;">"PCI:0000:00:1e.2"</span>,
              <span style="color: #005077; font-weight: bold;">"description"</span> : <span style="color: #30440f;">"Signal processing controller"</span>,
              <span style="color: #005077; font-weight: bold;">"product"</span> : <span style="color: #30440f;">"Sunrise Point-LP Serial IO SPI Controller #0"</span>,
              <span style="color: #005077; font-weight: bold;">"vendor"</span> : <span style="color: #30440f;">"Intel Corporation"</span>,
              <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"1e.2"</span>,
              <span style="color: #005077; font-weight: bold;">"businfo"</span> : <span style="color: #30440f;">"pci@0000:00:1e.2"</span>,
              <span style="color: #005077; font-weight: bold;">"version"</span> : <span style="color: #30440f;">"21"</span>,
              <span style="color: #005077; font-weight: bold;">"width"</span> : <span style="color: #0000c0;">64</span>,
              <span style="color: #005077; font-weight: bold;">"clock"</span> : <span style="color: #0000c0;">33000000</span>,
              <span style="color: #005077; font-weight: bold;">"configuration"</span> : {
                <span style="color: #005077; font-weight: bold;">"driver"</span> : <span style="color: #30440f;">"intel-lpss"</span>,
                <span style="color: #005077; font-weight: bold;">"latency"</span> : <span style="color: #30440f;">"0"</span>
              },
              <span style="color: #005077; font-weight: bold;">"capabilities"</span> : {
                <span style="color: #005077; font-weight: bold;">"bus_master"</span> : <span style="color: #30440f;">"bus mastering"</span>,
                <span style="color: #005077; font-weight: bold;">"cap_list"</span> : <span style="color: #30440f;">"PCI capabilities listing"</span>
              }
            },
            {
              <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"isa"</span>,
              <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"bridge"</span>,
              <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
              <span style="color: #005077; font-weight: bold;">"handle"</span> : <span style="color: #30440f;">"PCI:0000:00:1f.0"</span>,
              <span style="color: #005077; font-weight: bold;">"description"</span> : <span style="color: #30440f;">"ISA bridge"</span>,
              <span style="color: #005077; font-weight: bold;">"product"</span> : <span style="color: #30440f;">"Sunrise Point LPC Controller/eSPI Controller"</span>,
              <span style="color: #005077; font-weight: bold;">"vendor"</span> : <span style="color: #30440f;">"Intel Corporation"</span>,
              <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"1f"</span>,
              <span style="color: #005077; font-weight: bold;">"businfo"</span> : <span style="color: #30440f;">"pci@0000:00:1f.0"</span>,
              <span style="color: #005077; font-weight: bold;">"version"</span> : <span style="color: #30440f;">"21"</span>,
              <span style="color: #005077; font-weight: bold;">"width"</span> : <span style="color: #0000c0;">32</span>,
              <span style="color: #005077; font-weight: bold;">"clock"</span> : <span style="color: #0000c0;">33000000</span>,
              <span style="color: #005077; font-weight: bold;">"configuration"</span> : {
                <span style="color: #005077; font-weight: bold;">"latency"</span> : <span style="color: #30440f;">"0"</span>
              },
              <span style="color: #005077; font-weight: bold;">"capabilities"</span> : {
                <span style="color: #005077; font-weight: bold;">"isa"</span> : <span style="color: #55348e;">true</span>,
                <span style="color: #005077; font-weight: bold;">"bus_master"</span> : <span style="color: #30440f;">"bus mastering"</span>
              }
            },
            {
              <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"memory"</span>,
              <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"memory"</span>,
              <span style="color: #005077; font-weight: bold;">"handle"</span> : <span style="color: #30440f;">"PCI:0000:00:1f.2"</span>,
              <span style="color: #005077; font-weight: bold;">"description"</span> : <span style="color: #30440f;">"Memory controller"</span>,
              <span style="color: #005077; font-weight: bold;">"product"</span> : <span style="color: #30440f;">"Sunrise Point-LP PMC"</span>,
              <span style="color: #005077; font-weight: bold;">"vendor"</span> : <span style="color: #30440f;">"Intel Corporation"</span>,
              <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"1f.2"</span>,
              <span style="color: #005077; font-weight: bold;">"businfo"</span> : <span style="color: #30440f;">"pci@0000:00:1f.2"</span>,
              <span style="color: #005077; font-weight: bold;">"version"</span> : <span style="color: #30440f;">"21"</span>,
              <span style="color: #005077; font-weight: bold;">"width"</span> : <span style="color: #0000c0;">32</span>,
              <span style="color: #005077; font-weight: bold;">"clock"</span> : <span style="color: #0000c0;">33000000</span>,
              <span style="color: #005077; font-weight: bold;">"configuration"</span> : {
                <span style="color: #005077; font-weight: bold;">"latency"</span> : <span style="color: #30440f;">"0"</span>
              }
            },
            {
              <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"multimedia"</span>,
              <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"multimedia"</span>,
              <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
              <span style="color: #005077; font-weight: bold;">"handle"</span> : <span style="color: #30440f;">"PCI:0000:00:1f.3"</span>,
              <span style="color: #005077; font-weight: bold;">"description"</span> : <span style="color: #30440f;">"Audio device"</span>,
              <span style="color: #005077; font-weight: bold;">"product"</span> : <span style="color: #30440f;">"Sunrise Point-LP HD Audio"</span>,
              <span style="color: #005077; font-weight: bold;">"vendor"</span> : <span style="color: #30440f;">"Intel Corporation"</span>,
              <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"1f.3"</span>,
              <span style="color: #005077; font-weight: bold;">"businfo"</span> : <span style="color: #30440f;">"pci@0000:00:1f.3"</span>,
              <span style="color: #005077; font-weight: bold;">"version"</span> : <span style="color: #30440f;">"21"</span>,
              <span style="color: #005077; font-weight: bold;">"width"</span> : <span style="color: #0000c0;">64</span>,
              <span style="color: #005077; font-weight: bold;">"clock"</span> : <span style="color: #0000c0;">33000000</span>,
              <span style="color: #005077; font-weight: bold;">"configuration"</span> : {
                <span style="color: #005077; font-weight: bold;">"driver"</span> : <span style="color: #30440f;">"snd_hda_intel"</span>,
                <span style="color: #005077; font-weight: bold;">"latency"</span> : <span style="color: #30440f;">"32"</span>
              },
              <span style="color: #005077; font-weight: bold;">"capabilities"</span> : {
                <span style="color: #005077; font-weight: bold;">"bus_master"</span> : <span style="color: #30440f;">"bus mastering"</span>,
                <span style="color: #005077; font-weight: bold;">"cap_list"</span> : <span style="color: #30440f;">"PCI capabilities listing"</span>
              }
            },
            {
              <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"serial"</span>,
              <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"bus"</span>,
              <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
              <span style="color: #005077; font-weight: bold;">"handle"</span> : <span style="color: #30440f;">"PCI:0000:00:1f.4"</span>,
              <span style="color: #005077; font-weight: bold;">"description"</span> : <span style="color: #30440f;">"SMBus"</span>,
              <span style="color: #005077; font-weight: bold;">"product"</span> : <span style="color: #30440f;">"Sunrise Point-LP SMBus"</span>,
              <span style="color: #005077; font-weight: bold;">"vendor"</span> : <span style="color: #30440f;">"Intel Corporation"</span>,
              <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"1f.4"</span>,
              <span style="color: #005077; font-weight: bold;">"businfo"</span> : <span style="color: #30440f;">"pci@0000:00:1f.4"</span>,
              <span style="color: #005077; font-weight: bold;">"version"</span> : <span style="color: #30440f;">"21"</span>,
              <span style="color: #005077; font-weight: bold;">"width"</span> : <span style="color: #0000c0;">64</span>,
              <span style="color: #005077; font-weight: bold;">"clock"</span> : <span style="color: #0000c0;">33000000</span>,
              <span style="color: #005077; font-weight: bold;">"configuration"</span> : {
                <span style="color: #005077; font-weight: bold;">"driver"</span> : <span style="color: #30440f;">"i801_smbus"</span>,
                <span style="color: #005077; font-weight: bold;">"latency"</span> : <span style="color: #30440f;">"0"</span>
              }
            }
          ]
        },
        {
          <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"pnp00:00"</span>,
          <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"system"</span>,
          <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
          <span style="color: #005077; font-weight: bold;">"product"</span> : <span style="color: #30440f;">"Motherboard registers"</span>,
          <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"2"</span>,
          <span style="color: #005077; font-weight: bold;">"configuration"</span> : {
            <span style="color: #005077; font-weight: bold;">"driver"</span> : <span style="color: #30440f;">"system"</span>
          },
          <span style="color: #005077; font-weight: bold;">"capabilities"</span> : {
            <span style="color: #005077; font-weight: bold;">"pnp"</span> : <span style="color: #55348e;">true</span>
          }
        },
        {
          <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"pnp00:01"</span>,
          <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"system"</span>,
          <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
          <span style="color: #005077; font-weight: bold;">"product"</span> : <span style="color: #30440f;">"AT Real-Time Clock"</span>,
          <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"3"</span>,
          <span style="color: #005077; font-weight: bold;">"configuration"</span> : {
            <span style="color: #005077; font-weight: bold;">"driver"</span> : <span style="color: #30440f;">"rtc_cmos"</span>
          },
          <span style="color: #005077; font-weight: bold;">"capabilities"</span> : {
            <span style="color: #005077; font-weight: bold;">"pnp"</span> : <span style="color: #55348e;">true</span>
          }
        },
        {
          <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"pnp00:02"</span>,
          <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"generic"</span>,
          <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
          <span style="color: #005077; font-weight: bold;">"product"</span> : <span style="color: #30440f;">"PnP device INT3f0d"</span>,
          <span style="color: #005077; font-weight: bold;">"vendor"</span> : <span style="color: #30440f;">"Interphase Corporation"</span>,
          <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"4"</span>,
          <span style="color: #005077; font-weight: bold;">"configuration"</span> : {
            <span style="color: #005077; font-weight: bold;">"driver"</span> : <span style="color: #30440f;">"system"</span>
          },
          <span style="color: #005077; font-weight: bold;">"capabilities"</span> : {
            <span style="color: #005077; font-weight: bold;">"pnp"</span> : <span style="color: #55348e;">true</span>
          }
        },
        {
          <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"pnp00:03"</span>,
          <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"generic"</span>,
          <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
          <span style="color: #005077; font-weight: bold;">"product"</span> : <span style="color: #30440f;">"PnP device ATK3001"</span>,
          <span style="color: #005077; font-weight: bold;">"vendor"</span> : <span style="color: #30440f;">"Allied Telesyn Int'l"</span>,
          <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"5"</span>,
          <span style="color: #005077; font-weight: bold;">"configuration"</span> : {
            <span style="color: #005077; font-weight: bold;">"driver"</span> : <span style="color: #30440f;">"i8042 kbd"</span>
          },
          <span style="color: #005077; font-weight: bold;">"capabilities"</span> : {
            <span style="color: #005077; font-weight: bold;">"pnp"</span> : <span style="color: #55348e;">true</span>
          }
        },
        {
          <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"pnp00:04"</span>,
          <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"system"</span>,
          <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
          <span style="color: #005077; font-weight: bold;">"product"</span> : <span style="color: #30440f;">"Motherboard registers"</span>,
          <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"6"</span>,
          <span style="color: #005077; font-weight: bold;">"configuration"</span> : {
            <span style="color: #005077; font-weight: bold;">"driver"</span> : <span style="color: #30440f;">"system"</span>
          },
          <span style="color: #005077; font-weight: bold;">"capabilities"</span> : {
            <span style="color: #005077; font-weight: bold;">"pnp"</span> : <span style="color: #55348e;">true</span>
          }
        },
        {
          <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"pnp00:05"</span>,
          <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"system"</span>,
          <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
          <span style="color: #005077; font-weight: bold;">"product"</span> : <span style="color: #30440f;">"Motherboard registers"</span>,
          <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"7"</span>,
          <span style="color: #005077; font-weight: bold;">"configuration"</span> : {
            <span style="color: #005077; font-weight: bold;">"driver"</span> : <span style="color: #30440f;">"system"</span>
          },
          <span style="color: #005077; font-weight: bold;">"capabilities"</span> : {
            <span style="color: #005077; font-weight: bold;">"pnp"</span> : <span style="color: #55348e;">true</span>
          }
        },
        {
          <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"pnp00:06"</span>,
          <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"system"</span>,
          <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
          <span style="color: #005077; font-weight: bold;">"product"</span> : <span style="color: #30440f;">"Motherboard registers"</span>,
          <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"8"</span>,
          <span style="color: #005077; font-weight: bold;">"configuration"</span> : {
            <span style="color: #005077; font-weight: bold;">"driver"</span> : <span style="color: #30440f;">"system"</span>
          },
          <span style="color: #005077; font-weight: bold;">"capabilities"</span> : {
            <span style="color: #005077; font-weight: bold;">"pnp"</span> : <span style="color: #55348e;">true</span>
          }
        },
        {
          <span style="color: #005077; font-weight: bold;">"id"</span> : <span style="color: #30440f;">"pnp00:07"</span>,
          <span style="color: #005077; font-weight: bold;">"class"</span> : <span style="color: #30440f;">"system"</span>,
          <span style="color: #005077; font-weight: bold;">"claimed"</span> : <span style="color: #55348e;">true</span>,
          <span style="color: #005077; font-weight: bold;">"product"</span> : <span style="color: #30440f;">"Motherboard registers"</span>,
          <span style="color: #005077; font-weight: bold;">"physid"</span> : <span style="color: #30440f;">"9"</span>,
          <span style="color: #005077; font-weight: bold;">"configuration"</span> : {
            <span style="color: #005077; font-weight: bold;">"driver"</span> : <span style="color: #30440f;">"system"</span>
          },
          <span style="color: #005077; font-weight: bold;">"capabilities"</span> : {
            <span style="color: #005077; font-weight: bold;">"pnp"</span> : <span style="color: #55348e;">true</span>
          }
        }
      ]
    }
  ]
}
]

</pre>
</div>
</div>
</div>
