index.html

<div id="outline-container-org8e659dd" class="outline-3">
<h3 id="org8e659dd"><span class="section-number-3">1.5.</span> lspci</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-shell">lspci
</pre>
</div>

<pre class="example" id="org00c9b21">
00:00.0 Host bridge: Intel Corporation Xeon E3-1200 v6/7th Gen Core Processor Host Bridge/DRAM Registers (rev 02)
00:02.0 VGA compatible controller: Intel Corporation HD Graphics 620 (rev 02)
00:04.0 Signal processing controller: Intel Corporation Xeon E3-1200 v5/E3-1500 v5/6th Gen Core Processor Thermal Subsystem (rev 02)
00:14.0 USB controller: Intel Corporation Sunrise Point-LP USB 3.0 xHCI Controller (rev 21)
00:14.2 Signal processing controller: Intel Corporation Sunrise Point-LP Thermal subsystem (rev 21)
00:15.0 Signal processing controller: Intel Corporation Sunrise Point-LP Serial IO I2C Controller #0 (rev 21)
00:15.1 Signal processing controller: Intel Corporation Sunrise Point-LP Serial IO I2C Controller #1 (rev 21)
00:16.0 Communication controller: Intel Corporation Sunrise Point-LP CSME HECI #1 (rev 21)
00:17.0 SATA controller: Intel Corporation Sunrise Point-LP SATA Controller [AHCI mode] (rev 21)
00:1c.0 PCI bridge: Intel Corporation Sunrise Point-LP PCI Express Root Port #1 (rev f1)
00:1c.5 PCI bridge: Intel Corporation Sunrise Point-LP PCI Express Root Port #6 (rev f1)
00:1e.0 Signal processing controller: Intel Corporation Sunrise Point-LP Serial IO UART Controller #0 (rev 21)
00:1e.2 Signal processing controller: Intel Corporation Sunrise Point-LP Serial IO SPI Controller #0 (rev 21)
00:1f.0 ISA bridge: Intel Corporation Sunrise Point LPC Controller/eSPI Controller (rev 21)
00:1f.2 Memory controller: Intel Corporation Sunrise Point-LP PMC (rev 21)
00:1f.3 Audio device: Intel Corporation Sunrise Point-LP HD Audio (rev 21)
00:1f.4 SMBus: Intel Corporation Sunrise Point-LP SMBus (rev 21)
02:00.0 Network controller: Intel Corporation Wireless 8265 / 8275 (rev 78)
</pre>
</div>
</div>

<div id="outline-container-org19ced62" class="outline-3">
<h3 id="org19ced62"><span class="section-number-3">1.6.</span> lsusb</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">
<pre class="src src-shell">lsusb
</pre>
</div>

<pre class="example" id="orge95c309">
Bus 002 Device 001: ID 1d6b:0003 Linux Foundation 3.0 root hub
Bus 001 Device 005: ID 8087:0a2b Intel Corp. Bluetooth wireless interface
Bus 001 Device 055: ID 13d3:5a07 IMC Networks VGA UVC WebCam
Bus 001 Device 050: ID 046d:c31c Logitech, Inc. Keyboard K120
Bus 001 Device 002: ID 0458:0186 KYE Systems Corp. (Mouse Systems) Genius DX-120 Mouse
Bus 001 Device 001: ID 1d6b:0002 Linux Foundation 2.0 root hub
</pre>
</div>
</div>

<div id="outline-container-org0c90093" class="outline-3">
<h3 id="org0c90093"><span class="section-number-3">1.7.</span> lsblk</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">
<pre class="src src-shell">lsblk
</pre>
</div>

<pre class="example" id="org6aebf5a">
NAME   MAJ:MIN RM   SIZE RO TYPE MOUNTPOINTS
sda      8:0    0 447.1G  0 disk
sda1   8:1    0   100M  0 part /boot/efi
sda2   8:2    0    16M  0 part
sda3   8:3    0    97G  0 part
sda4   8:4    0   350G  0 part /
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: nhannht</p>
<p class="date">Created: 2023-01-07 T7 21:40</p>
</div>
</body>
</html>